# 귀찮다...
성적 = str(input())
구분 = list(성적)
if(구분[0] == "A"):
    if(구분[1]=="+"):
        print("4.3")
    elif(구분[1]=="0"):
        print("4.0")
    elif(구분[1]=="-"):
        print("3.7")
elif((구분[0] == "B")):
    if(구분[1]=="+"):
        print("3.3")
    elif(구분[1]=="0"):
        print("3.0")
    elif(구분[1]=="-"):
        print("2.7")
elif((구분[0] == "C")):
    if(구분[1]=="+"):
        print("2.3")
    elif(구분[1]=="0"):
        print("2.0")
    elif(구분[1]=="-"):
        print("1.7")
elif((구분[0] == "D")):
    if(구분[1]=="+"):
        print("1.3")
    elif(구분[1]=="0"):
        print("1.0")
    elif(구분[1]=="-"):
        print("0.7")
elif((구분[0] == "F")):
    print("0.0")